using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using System;
using Zenject;

public class ChooseNamePresenter : IPresenter
{
    private List<string> _maleNames = new List<string>()
    {
        "Аарон","Абрам","Аваз","Аввакум","Август","Августин","Авдей","Авдий","Авксентий","Авраам","Аврор","Автандил","Агап","Агафон","Аггей",
        "Адам","Адис","Адольф","Адриан","Азамат","Азарий","Азат","Айдар","Айнур","Айрат","Акакий","Аким","Аксён","Алан","Алевтин","Александр",
        "Алексей","Алексий","Ален","Али","Алихан","Алмаз","Алоис","Альберт","Альвиан","Альфред","Амадей","Амадеус","Амаяк","Амвросий","Амин",
        "Анастасий","Анатолий","Анвар","Ангел","Андоим","Андрей","Андрон","Андрэ","Анжей","Аникита","Анисим","Антип","Антон","Антонин","Ануфрий",
        "Анфим","Аполлинарий","Апполинарий","Арам","Арий","Аристарх","Аркадий","Арман","Армен","Арно","Арнольд","Арон","Арсен","Арсений","Арслан",
        "Артамон","Артем","Артемий","Артур","Архип","Архипп","Арье","Аскольд","Афанасий","Афиноген","Ахмет","Ашот","Бахрам","Бежен","Бенедикт",
        "Берек","Бернар","Богдан","Боголюб","Болеслав","Бонифаций","Бореслав","Борис","Борислав","Боян","Бронислав","Бруно","Булат","Вадим",
        "Валентин","Валерий","Валерьян","Вальдемар","Вальтер","Вардан","Варлаам","Варлам","Варфоломей","Василий","Ватслав","Вацлав","Велизар",
        "Велимир","Велор","Венедикт","Вениамин","Викентий","Виктор","Вилен","Вилли","Вильгельм","Виссарион","Виталий","Витаутас","Витольд","Влад",
        "Владимир","Владислав","Владлен","Влас","Власий","Володар","Вольдемар","Всеволод","Вячеслав","Гавриил","Гаврила","Гай","Гайдар","Галактион",
        "Гамлет","Гарри","Гаспар","Гастон","Гаяс","Гевор","Геворг","Геласий","Гений","Геннадий","Генри","Генрих","Георгий","Геральд","Герасим",
        "Герман","Гермоген","Глеб","Гоар","Гордей","Гордон","Горислав","Градимир","Граф","Григорий","Гурий","Густав","Давид","Давлат","Давыд",
        "Дамиан","Дамир","Дан","Даниил","Данила","Данислав","Даньяр","Дар","Дементий","Демид","Демократ","Демьян","Денис","Джамал","Джеймс",
        "Джереми","Джозеф","Джордан","Джорж","Дидим","Дик","Димитрий","Дин","Динар","Динасий","Диомид","Дмитрий","Добрыня","Дональд","Донат",
        "Донатос","Дорофей","Евгений","Евграф","Евдоким","Евлампий","Евлогий","Евсей","Евстафий","Егор","Елеазар","Елизар","Елисей","Емельян",
        "Епифан","Еремей","Ермак","Ермил","Ермолай","Ерофей","Ефим","Ефимий","Ефрем","Жан","Ждан","Жерар","Жорж","Закир","Замир","Заур","Захар",
        "Захария","Зенон","Зигмунд","Зиновий","Зорий","Зосима","Зот","Зураб","Иакинф","Ибрагим","Иван","Игнат","Игнатий","Игорь","Иероним",
        "Измаил","Израиль","Изяслав","Иларион","Илиан","Илларион","Ильхам","Ильшат","Илья","Ильяс","Иннокентий","Инокентий","Иоаким","Иоанн",
        "Ион","Ионас","Ионос","Иосиф","Ипполит","Ираклий","Иржи","Ириней","Ириний","Иса","Исаак","Исаакий","Исай","Исайя","Исидор","Искандер",
        "Ислам","Исмаил","Иулиан","Июлий","Казбек","Казимир","Кай","Камиль","Капитон","Карен","Карим","Карл","Каспар","Касьян","Ким","Кир",
        "Кирилл","Клавдий","Клаус","Клемент","Клементий","Клим","Климент","Клод","Кондрат","Кондратий","Конкордий","Конрад","Константин","Корней",
        "Корнилий","Краснослав","Ксаннф","Кузьма","Куприян","Лавр","Лаврентий","Лазарь","Ларион","Лев","Леван","Левон","Ленар","Леон","Леонард",
        "Леонид","Леонтий","Леопольд","Лермонт","Лис","Лука","Лукий","Лукьян","Любим","Любомир","Людвиг","Люсьен","Люций","Мавлюда","Магистриан",
        "Мадлен","Май","Майкл","Макар","Макарий","Макс","Максим","Максимилиан","Максимильян","Максуд","Мансур","Мануил","Мар","Марат","Мариан",
        "Марин","Марк","Маркел","Марс","Марсель","Мартин","Мартын","Матвей","Махмуд","Мелентий","Мераб","Мефодий","Мечеслав","Мечислав","Микула",
        "Милад","Милан","Милен","Милослав","Мир","Мирон","Мирослав","Мисаил","Митрофан","Митя","Михаил","Мичлов","Мишлов","Модест","Моисей",
        "Мстислав","Мурат","Муслим","Мухаммед","Мэлор","Назар","Назарий","Наиль","Натан","Наум","Неонил","Нестор","Никанор","Никита","Никифор",
        "Никодим","Никола","Николай","Никон","Нил","Нильс","Нисон","Нифонт","Новомир","Норман","Норманн","Овидий","Октябрь","Олан","Олег","Олесь",
        "Ольгерд","Онисим","Онуфрий","Орест","Орландо","Осип","Оскар","Остап","Остромир","Павел","Памфил","Панкрат","Пантелеймон","Панфил",
        "Парамон","Парфений","Пахом","Пересвет","Петр","Пимен","Платон","Порфирий","Потап","Прозор","Прокопий","Прокофий","Протасий","Прохор",
        "Равиль","Радий","Радик","Радислав","Радомир","Радослав","Разиль","Разумник","Раис","Райан","Раймонд","Рамазан","Рамиз","Рамиль","Рамон",
        "Ранель","Расим","Расул","Ратибор","Ратмир","Рафаил","Рафаэль","Рафик","Рашид","Рем","Ренольд","Ринат","Рифат","Рихард","Ричард","Роберт",
        "Родион","Ролан","Роман","Ростислав","Рубен","Рудольф","Руслан","Рустам","Руфин","Рушан","Рэй","Сабир","Савва","Савел","Савелий","Самвел",
        "Самсон","Самуил","Свет","Светлан","Светозар","Светослав","Святогор","Святополк","Святослав","Севастьян","Север","Северин","Северьян","Семен",
        "Серафим","Сергей","Сидор","Сильвестр","Слава","Созон","Сократ","Соломон","Спартак","Спиридон","Стакрат","Сталий","Станимир","Станислав",
        "Степан","Стефан","Стивен","Стоян","Султан","Тагир","Таис","Тайлер","Талик","Тамаз","Тамерлан","Тарас","Тельман","Тельнан","Теодор","Терентий",
        "Тибор","Тиграм","Тигран","Тигрий","Тимон","Тимофей","Тимур","Тит","Тихомир","Тихон","Томас","Трифон","Трофим","Тунгуз","Ульманас","Умар",
        "Устин","Фаддей","Фадей","Фазиль","Фанис","Фарид","Фархад","Федор","Федосей","Федот","Феликс","Феодосии","Феодосий","Фердинанд","Фидель",
        "Филат","Филимон","Филипп","Флорентий","Фома","Франц","Фред","Фридрих","Фрол","Фуад","Хабиб","Хаким","Харитон","Христиан","Христос",
        "Христофор","Цезарь","Чарльз","Чеслав","Чингиз","Чингисхан","Шамиль","Шарль","Шерлок","Шота","Щеголь","Эдвард","Эдгар","Эдмунд","Эдуард",
        "Эльдар","Эмиль","Эмин","Эммануил","Эраст","Эрик","Эрнест","Юлиан","Юлий","Юнус","Юрий","Юстин","Юхим","Яким","Яков","Якун","Ян","Януарий",
        "Яромир","Ярослав","Ясон"
    };

    private List<string> _femaleNames = new List<string>()
    {
        "Августа","Августина","Авдотья","Авигея","Аврора","Автоноя","Агапия","Агата","Агафья","Аглая","Агнес","Агнесса","Агнета","Агния","Агриппина",
        "Агунда","Ада","Аделаида","Аделина","Аделия","Адель","Адельфина","Адиля","Адриана","Адриенна","Аза","Азалия","Азиза","Аида","Айганым","Айгерим",
        "Айгуль","Айжан","Айлин","Айнагуль","Аксинья","Акулина","Алана","Алдона","Алевтина","Александра","Александрина","Алёна","Алеся","Алика","Алико",
        "Алима","Алина","Алира","Алиса","Алия","Алла","Алсу","Алтжин","Альба","Альберта","Альбина","Альвина","Альжбета","Альфия","Альфреда","Аля","Амалия",
        "Амаль","Аманда","Амелия","Амина","Амира","Анаис","Анаит","Анастасия","Ангелина","Андриана","Анеля","Анжела","Анжелика","Анжиолетта","Анисия","Анисья",
        "Анита","Анна","Антонина","Анфиса","Анэля","Аполлинария","Аполлония","Арабелла","Ариадна","Ариана","Арина","Артемида","Архелия","Арьяна","Асель","Асида",
        "Асия","Ассоль","Астра","Астрид","Ася","Аурелия","Афанасия","Аэлита","Аюна","Бажена","Беата","Беатриса","Белинда","Белла","Бенедикта","Береслава","Берта",
        "Биргит","Бирута","Богдана","Божена","Борислава","Бриллиант","Бронислава","Валентина","Валерия","Ванда","Ванесса","Варвара","Василина","Василиса","Васса",
        "Венди","Венера","Вера","Верона","Вероника","Версавия","Веселина","Весна","Весняна","Веста","Вета","Ветта","Вида","Видана","Викторина","Виктория","Вилена",
        "Вилора","Винетта","Виоланта","Виолетта","Виргиния","Виринея","Вита","Виталина","Влада","Владислава","Владлена","Властилина","Габи","Габриеле","Габриэлла",
        "Галина","Галия","Гаянэ","Гелана","Гелена","Гелианна","Гелла","Генриетта","Георгина","Гера","Герда","Гертруда","Глафира","Гликерия","Глория","Гоар","Говхар",
        "Горица","Гортензия","Гражина","Грета","Гузель","Гулия","Гульмира","Гульназ","Гульнара","Гульшат","Гуннхильда","Гюзель","Гюльджан","Дайна","Далия","Дамира",
        "Дана","Даниэла","Дания","Данна","Данута","Дара","Дарерка","Дарина","Дария","Дарья","Дарьяна","Даша","Даяна","Дебора","Джамиля","Джанет","Джема","Джемма",
        "Дженифер","Дженна","Дженнифер","Джессика","Джоан","Джулия","Джульетта","Диана","Дилара","Дильназ","Дильнара","Диля","Дина","Динара","Динора","Диодора",
        "Дионисия","Дита","Диша","Долорес","Доля","Доминика","Домна","Дора","Дэнна","Ева","Евангелина","Евгения","Евдокия","Евпраксия","Евфимия","Екатерина",
        "Елена","Елизавета","Ермиония","Есения","Ефимия","Жаклин","Жанетт","Жанна","Жасмин","Женевьева","Жозефина","Жюли","Забава","Заира","Залина","Замира",
        "Зара","Зарема","Зарина","Захария","Земфира","Зинаида","Зита","Злата","Златослава","Зоряна","Зоя","Зульфия","Зухра","Иванна","Ивета","Иветта","Ивона",
        "Ида","Изабелла","Изольда","Илария","Илена","Илзе","Илиана","Илона","Ильзе","Инара","Инга","Инге","Ингеборга","Индира","Инесса","Инна","Иоанна",
        "Иоланта","Ираида","Ирена","Ирина","Ирма","Ирэн","Ирэна","Искра","Иулия","Июлия","Ия","Йенни","Кайли","Калерия","Камилла","Камиля","Капитолина","Кара",
        "Карен","Карима","Карина","Карла","Кармелитта","Каролина","Катарина","Каторина","Келен","Кира","Кирилла","Клавдия","Клара","Клариса","Кларисса",
        "Клементина","Климентина","Констанция","Консуэло","Кора","Корнелия","Крис","Кристина","Ксения","Лада","Лайма","Лали","Ламия","Лана","Ландыш","Лаодика",
        "Лара","Лариса","Лаура","Лейла","Лейсан","Леля","Леокадия","Леонида","Лера","Леся","Лея","Лиана","Лигия","Лидия","Лиза","Лика","Лили","Лилиана",
        "Лилия","Лилу","Лина","Линда","Линнея","Лиора","Лира","Лия","Лола","Лолита","Лора","Луиза","Лукерья","Лукия","Лунара","Любава","Любовь","Любомила",
        "Людмила","Людовика","Люция","Ляля","Магали","Магда","Магдалина","Мадина","Майя","Малика","Мальвина","Мальта","Мара","Маргарет","Маргарита",
        "Марианна","Марика","Марина","Мариса","Марисоль","Мариша","Мария","Марлен","Марселина","Марта","Мартина","Маруся","Марфа","Марьям","Марьяна",
        "Мастридия","Матильда","Матрёна","Мафтуха","Мелания","Мелиана","Мелисса","Мелитта","Мериса","Мика","Мила","Милада","Милана","Милда","Милена",
        "Милиса","Милица","Милолика","Милослава","Мира","Мирдза","Мирей","Миропия","Мирослава","Мирра","Михайлина","Михримах","Мишель","Мия","Мод",
        "Моник","Моника","Муза","Мэдисон","Мэри","Мю","Надежда","Наджия","Надия","Надя","Назгуль","Назира","Наиля","Наима","Нана","Нания","Наоми",
        "Наталия","Наталья","Нателла","Нева","Нега","Нелли","Неолина","Неонила","Неонилла","Ника","Никки","Николетта","Николь","Нила","Нилуфар",
        "Нина","Нинель","Нинна","Ноа","Номи","Нонна","Нора","Нурия","Нэнси","Одетта","Оксана","Октавия","Октябрина","Олеся","Оливия","Олимпиада",
        "Ольга","Офелия","Павла","Павлина","Памела","Патрисия","Патриция","Пелагея","Перизат","Полианна","Полина","Прасковья","Рада","Радмила",
        "Радосвета","Радослава","Раиса","Ралина","Рамина","Рая","Ревекка","Регина","Рема","Рената","Риана","Римма","Рина","Рита","Роберта","Рогнеда",
        "Роза","Розалина","Розалия","Роксалана","Роксана","Романа","Ростислава","Рузалия","Рузанна","Рузиля","Румия","Русалина","Руслана","Руфина",
        "Сабина","Сабрина","Сажида","Саида","Саломея","Самира","Санда","Сандра","Сания","Санта","Сара","Сарра","Сати","Сафина","Светлана","Святослава",
        "Севара","Северина","Селена","Серафима","Силика","Сильва","Сильвия","Сима","Симона","Слава","Снежана","Созия","Соня","София","Софья",
        "Станислава","Стелла","Стефания","Сусанна","Таира","Таисия","Тала","Тамара","Тамила","Тара","Татьяна","Теодора","Тереза","Тина","Томила",
        "Тора","Триана","Ульяна","Урсула","Устина","Устинья","Фаиза","Фаина","Фания","Фаня","Фарида","Фатима","Фая","Фекла","Фелиция","Феруза","Физура",
        "Флора","Франсуаза","Француаза","Фредерика","Фрида","Харита","Хилари","Хильда","Хлоя","Христина","Христя","Цветана","Цецилия","Челси","Чеслава",
        "Чулпан","Шакира","Шарлотта","Шейла","Шелли","Шерил","Эвелина","Эвита","Эдда","Эдита","Элеонора","Элиана","Элиза","Элина","Элла","Эллада",
        "Элоиза","Эльвина","Эльвира","Эльга","Эльза","Эльмира","Эльнара","Эля","Эмили","Эмилия","Эмма","Эрика","Эрнестина","Эсмеральда","Этель","Этери",
        "Юзефа","Юлия","Юна","Юния","Юнона","Юханна","Ядвига","Яна","Янина","Янита","Янка","Ярина","Ярослава","Ясмина"
    };

    private List<string> _secondNames = new List<string>()
    {
        "Абеляр","Авад","Авалиани","Авербах","Авербух","Агилар","Агустини","Адамс","Адамчик","Адан","Адлард","Азаро","Аксар","Аксельрод","Албахари",
        "Алегрия","Алексис","Ален","Алерамо","Аллен","АлмондАлон","Альбер","Альберти","Альберус","Альварес","Альваро","Альвер","Альвинг","Альдани",
        "Альмагор","Амбра","Амери","Амио","Аммиан","Ананд","Анвари","Ангел","Андро","Арад","Аракида","Арден","Ардер","Аренс","Арент","Аретино","Аржан",
        "Арлан","Арреола","Арриан","Арро","Арто","Артуро","Ассо","Астуриас","Атена","Атилла","Аттиль","Ахо","Аш","Ашар","Баар","Байер","Байяр",
        "Баллард","Банвиль","Банделло","Баньян","Бар","Барбери","Барбо","Барбье","Баретти","Барри","Барт","Бартон","Бах","Бахман","Бейкер","Бейли",
        "Бейль","Бейнс","Бембо","Бенедетти","Бентли","Бенцони","Беранже","Берент","Беркли","Бланк","Блейк","Блест","Божидар","Бренцони","Боною",
        "Бонуар","Боон","Борд","Борель","Боско","Боярдо","Брайсон","Брайт","Бранд","Брандис","Брасс","Брентано","Бретон","Бронте","Брукс","Булль",
        "Вайль","Валенс","Валери","Валлер","Валлериус","Валлес","Валь","Вальдес","Варго","Вассиан","Вебер","Вейль","Вейсс","Веллер","Веннер","Верт",
        "Виалар","Виан","Видади","Видал","Виже","Визель","Вильде","Виндж","Вольф","Вуд","Вульф","Габор","Гавальдо","Гай","Галан","Галеано","Галеви",
        "Галера","Галлант","Галло","Гамильтон","Гаммер","Гарднер","Гарленд","Гарнье","Гародию","Гауф","Гвардини","Гвиницелли","Гейер","Гейерманс",
        "Гейм","Геккер","Геллер","Гельфанд","Генц","Герарди","Герберт","Герен","Герольд","Герт","Герц","Гесс","Гессе","Гессен","Гилельс","Гилен",
        "Гомес","Гонкур","Гонкур","Гонсалес","Горан","Госс","Гофман","Гофф","Гоцци","Грааль-Арельский","Гранже","Грасс","Граццини","Гренье","Гренц",
        "Грессе","Гримм","Грин","Гросс","ДД’Актиль","Д’Анкона","Д’Обинье","Д’Обиньякю","ДарДариусю","ДеВилье","ДеЛаМар","ДеЛазари","ДеЛинт","ДеРада",
        "ДеРоберти","Дебиоль","Деборд","Делиль","Джойс","Джонс","Джонсон","Джордан","Джордано","Джордж","ДиПрима","ДиФилиппо","Диксон","Доде","Додж",
        "Долинго","Дон-Аминадо","Дор","Доррис","Дрейк","Дуглас","Дункан","Дюамель","Дюбуа","Дюваль","Дюпре","Жак","Жамен","Жамм","Жандр","Жане","Жарри",
        "Жарре","Жене","Жане","Женни","Жильбер","Жуандо","Зегерс","Зима","Ивинг","Иво","Имбер","Имбриани","Инбер","Иордани","Ирвин","Ирвинг","Кавальканти",
        "Кавана","Каллас","Калхано","Кальвейра","Кальвино","Кальдерон","Капелла","Капелли","Капеллони","Каппелло","Кардоне","Каркано","Карр",
        "Карре","Картер","Картленд","Каскалес","Касс","Кассиани","Кастро","КатоКахана","Кахане","Квин","Кей","Кельман","Кемаль","Кено","Кианто",
        "Ким","Кинг","Кино","Кинтана","Кипиани","Киплинг","Кирино","Кит","Кито","Клавель","Кларк","Клаф","Кливленд","Клиффорд","Клодель",
        "Ковальджи","Кола","Коннели","Конон","Конради","Коньяр","Король","Коронадо","Корренти","Корсо","Корт","Корти","Корф","Кремер","Критон",
        "Крон","Кросс","Кьяри","Кьярини","Лавант","Лави","ЛагранжЛазар","Ламур","Ланжелан","Ланжерон","Ланн","Лануа","Ларбо","Ларра","Ларри",
        "Ларсен","Ласкер","Лаури","Леандр","Левальд","Левант","Леконт","Леман","Лемерсье","Леметр","Лемонте","Лемуан","Лемьер","Ленц","Леопарди",
        "Леру","Леруа","Лесс","Лессинг","Ли","Лили","Липтон","Лир","Лисарди","Лист","Лодж","Локс","Лонг","Лонс","Лоон","Лопес-Вега","Лопес",
        "Лорд","Лоренс","Лоренцо","Лори","Лукас","Лурье","Магориан","Мадо","Мазиус","Май","МайерМайрон","Маккарти","Маккей","Маккензи",
        "Мальро","Мандельштам","Манджи","Мандино","Манн","Манро","Манто","Мао","Маран","Марани","Маре","Мариас","Маринетти","Марино",
        "Марк-Мишель","Марло","Маро","Марр","Марс","Марсе","Марсель","Мартен","Марти","Мартин","Марциан","Марш","Маршак","Маршалл","Маскаро",
        "Масс","Машаду","Меир","Мей","Мейер","Мейлер","Мелло","Мендес","Мера","Мери","Мериме","Меринг","Мерино","Меркури","Мерло","Мерсье",
        "Мертон","Местре","Милани","Миллер","Милли","Миллиган","Миль","Мильтон","Мирсай","Мистри","Миура","Михельсон","Модиано","Молинари",
        "Молине","Монро","Монтанелли","Монтенегро","Монтень","Морави","Моралес","Моран","Моранте","Морелле","Морель","Мориц","Моррис","Мур",
        "Мюррей","Мюссе","Мюссо","Надира","НадсонНарбут","Нариньяни","Нарсис","Невилл","Негри","Нерваль","Нере","Нерис","Нерсес","Нефф",
        "Никки","Никколини","Никс","Нильсен","","Ним","Ниммо","Новалис","Нолан","Нолл","Норрис","Нортон","Ньюман","Ойербах","Оливер","Оркан",
        "Ормандо","Ортен","Ортон","Орци","Осман","Оссиан","Остер","Остерман","Отеро","Пант","Паолини","Паркер","Парр","Парун","Пас","Патрици",
        "Перес","Перри","Перро","Перси","Пикард","Пирс","Плат","Платен","","Плесси","Полет","Полициано","Понтано","Портер","Поттер","Престон",
        "Принцис","Пристли","Райс","РайтРассел","Раффи","Рахман","Рашильд","Резерфорд","Рей","Рейд","Рейн","Рембо","РенанРенар","Реньяр",
        "Ривера","Рид","Риммель","Ринальдо-д'Аквино","Риц","Роббинс","Робер","Роберстон","Робертс","Робинсон","Роган","Родари","Рок","Рокетт",
        "Роллан","РоллиРоллинс","Ромер","Ромм","Росс","Россе","Россетти","Ростан","Руа","Руссо","Сабатини","Сабир","Сабо","Саверьен",
        "Савиано","Савиньон","Савиоли","Саймон","Санд","Сарт","Сафир","Сиверс","Секст","Сен-Жорж","Сент-Аман","Сент-Олер","Сент-ЭкзюпериСерафино",
        "Сильва","Симмонс","Симон","Сирс","Смарт","СмитСорель","Соррентино","СпаркСпаркс","Спациан","Старк","Стафф","Стельмах","Стерн","Стиль",
        "Стратис","Стросс","Строцц","СтюартСуарес","Сюар","Тадеос","ТароТассо","Тирсо","Тиссо","Тит","Тома","Томас","Томсон","Топелиус","Тор",
        "Торелли","Торо","Торрес","Уайт","Уилсон","Унсури","Урбан","Ури","ФаберФабри","Фабрис","Фабрициус","Фанте","Фаст","Фейербах","Фернандес",
        "Ферран","Феррисс","Фест","Филдинг","Фиори","Фицджеральд","Фишер","Флинн","Флинт","Флориан","Фогель","Фокс","ФонтанФонтенель","Фор",
        "Форд","Форсайт","Фосс","Фоссе","Франс","Фред","Фрейн","Фрид","Хаггард","Хантер","Харрис","Харт","Хилл","Хофф","Хоффман","Черри","Шабах",
        "Шагар","Шакир","Шамир","Шапиро","Шар","Шаррон","Шафер","Шаферан","Шафран","Шафф","Шахани","Шахар","Шахрияр","Швейцер","Шевалль","Шевалье",
        "Шекли","Шелдон","Шелли","Шепард","Шерман","Шмидт","Шопенгауэр","Шоу","Штерн","Шульц","Шуман","Шумахер","Эванс","Эвола","Эгарт","Эланд",
        "Эмерсон","Эрдман","Эриксон","Эрнандес","Эспиноса","Юнг","Юрис","Ян","Янг"
    };

    public event Action<ICharacter> GoNext;

    private ChooseNameView _view;
    private CharacterWithNameAndProphecy _character;
    private AudioManager _audioManager;
    private string _name;
    private string _sex = "Ж";

    [Inject]
    private void Construct(AudioManager audioManager) => _audioManager = audioManager;

    public void Initialize(ChooseNameView view, ICharacter character)
    {
        _view = view;
        _character = (CharacterWithNameAndProphecy)character;
        Subscribe();
    }

    private void Subscribe()
    {
        _view.ChooseName += ChooseNameInputed;
        _view.ChooseSex += ChooseSexSelected;
        _view.GenerateName += GenerateNamePressed;
        _view.GoNext += GoNextDown;
    }

    private void GoNextDown()
    {
        if (_name.Length > 1)
        {
            _audioManager.PlayDone();
            Unscribe();
            _character.SetName(_name);
            _character.SetGender(_sex);
            GoNext?.Invoke(_character);
            _view.DestroyView();
        }
        else
            _audioManager.PlayWarning();  
    }

    private void GenerateNamePressed()
    {
        _audioManager.PlayClick();
        
        if(_sex == "Ж")        
            _name = $"{_femaleNames[PoleChudes.GenerateIntValue(_femaleNames.Count - 1)]} {_secondNames[PoleChudes.GenerateIntValue(_secondNames.Count - 1)]}";
        
        else
            _name = $"{_maleNames[PoleChudes.GenerateIntValue(_maleNames.Count - 1)]} {_secondNames[PoleChudes.GenerateIntValue(_secondNames.Count - 1)]}";

        _view.SetName(_name);
    }

    private void ChooseSexSelected(string obj)
    {
        _audioManager.PlayClick();
        _sex = obj;
    }

    private void ChooseNameInputed(string obj)
    {
        _audioManager.PlayClick();
        _name = obj;
    }

    private void Unscribe()
    {
        _view.ChooseName -= ChooseNameInputed;
        _view.ChooseSex -= ChooseSexSelected;
        _view.GenerateName -= GenerateNamePressed;
        _view.GoNext -= GoNextDown;
    }



}
